BareMetalTestLab/blackmagic-esp32-c5/components/esp32-platform/platform.h
#pragma once
#include <timing.h>
#include <stdbool.h>

extern uint32_t swd_delay_cnt;

void platform_swdio_mode_float(void);
void platform_swdio_mode_drive(void);
void platform_jtag_pins_init(void);
void platform_gpio_set_level(int32_t gpio_num, uint32_t value);
void platform_gpio_set(int32_t gpio_num);
void platform_gpio_clear(int32_t gpio_num);
int platform_gpio_get_level(int32_t gpio_num);

void led_set_red(uint8_t value);
void led_set_green(uint8_t value);
void led_set_blue(uint8_t value);

#if defined(CONFIG_IDF_TARGET_ESP32C6)
#define PLATFORM_IDENT "ESP32-C6"
#elif defined(CONFIG_IDF_TARGET_ESP32C5)
#define PLATFORM_IDENT "ESP32-C5"
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#define PLATFORM_IDENT "ESP32-C3"
#elif defined(CONFIG_IDF_TARGET_ESP32C2)
#define PLATFORM_IDENT "ESP32-C2"
#else
#define PLATFORM_IDENT CONFIG_IDF_TARGET
#endif

#define NO_USB_PLEASE

#define SET_RUN_STATE(state) \
    {                        \
    }
#define SET_IDLE_STATE(state) \
    {                         \
    }
#define SET_ERROR_STATE(state) \
    {                          \
    }

#define TMS_SET_MODE() \
    do                 \
    {                  \
        platform_jtag_pins_init(); \
    } while (0)

// ON ESP32 we dont have the PORTS, this is dummy value until code is corrected
#define SWCLK_PORT (0)
#define SWDIO_PORT SWCLK_PORT

#undef PLATFORM_HAS_TRACESWO

/* Runtime-configurable pin numbers (set before first use, default values in platform.c) */

#define DEFAULT_TMS_PIN 26
#define DEFAULT_TCK_PIN 25
#define DEFAULT_TDI_PIN 23
#define DEFAULT_TDO_PIN 24
#define DEFAULT_TRST_PIN 27

extern int32_t g_pin_tms_swdio;
extern int32_t g_pin_tck_swclk;
extern int32_t g_pin_tdi;
extern int32_t g_pin_tdo_swo;
extern int32_t g_pin_trst;

#define SWDIO_PIN   (g_pin_tms_swdio)
#define SWCLK_PIN   (g_pin_tck_swclk)
#define TRACESWO_PIN (g_pin_tdo_swo)

/* Keep Black Magic style aliases: SWDIO/TMS and SWCLK/TCK share lines. */
#define TMS_PORT   SWDIO_PORT
#define TDI_PORT   SWDIO_PORT
#define TDO_PORT   SWDIO_PORT
#define TCK_PORT   SWDIO_PORT
#define TRST_PORT  SWDIO_PORT

/* 4-wire JTAG mapping — aliases of the runtime globals above */
#define TMS_PIN  (g_pin_tms_swdio)
#define TDI_PIN  (g_pin_tdi)
#define TDO_PIN  (g_pin_tdo_swo)
#define TCK_PIN  (g_pin_tck_swclk)
#define TRST_PIN (g_pin_trst)

#define gpio_set_val(port, pin, value)       \
    do                                       \
    {                                        \
        platform_gpio_set_level(pin, value); \
    } while (0);

#define gpio_set(port, pin) platform_gpio_set(pin)
#define gpio_clear(port, pin) platform_gpio_clear(pin)
#define gpio_get(port, pin) platform_gpio_get_level(pin)

#define SWDIO_MODE_FLOAT()           \
    do                               \
    {                                \
        platform_swdio_mode_float(); \
    } while (0)

#define SWDIO_MODE_DRIVE()           \
    do                               \
    {                                \
        platform_swdio_mode_drive(); \
    } while (0)

typedef struct usbd_device usbd_device;
void usb_serial_set_config(usbd_device *dev, uint16_t value);

bool gdb_serial_get_dtr(void);

void debug_serial_run(void);
uint32_t debug_serial_fifo_send(const char *fifo, uint32_t fifo_begin, uint32_t fifo_end);

/* RTT buffer sizes for ESP32 platform */
#define RTT_UP_BUF_SIZE   (2048U + 8U)
#define RTT_DOWN_BUF_SIZE 512U
